<template>
    <div class="gr_grid-vn-tooltip" v-if="tipIndex > 0">{{$t(listBody[tipIndex])}}</div>
    <!-- SP 特殊說明 -->
    <div class="gr_grid-vn-tooltip gr_grid-vn-tooltip--sp" v-else>
        <div>{{`${$t('common_020')}：${$t('vn_t_033')}`}}</div>
        <!-- '小' '00~49' -->
        <div>{{`${$t('common_021')}：${$t('vn_t_034')}`}}</div>
        <!-- '单' '00 ~ 99 中的单数号码' -->
        <div>{{`${$t('common_024')}：${$t('vn_t_035')}`}}</div>
        <!-- '双' '00 ~ 99 中的双数号码' -->
        <div>{{`${$t('common_025')}：${$t('vn_t_036')}`}}</div>
        <!-- '大单' '50 ~ 99 中的单数号码' -->
        <div>{{`${$t('mark6_t_027')}：${$t('vn_t_037')}`}}</div>
        <!-- '大双' '50 ~ 99 中的双数号码' -->
        <div>{{`${$t('mark6_t_028')}：${$t('vn_t_038')}`}}</div>
        <!-- '小单' '00 ~ 49 中的单数号码' -->
        <div>{{`${$t('mark6_t_029')}：${$t('vn_t_039')}`}}</div>
        <!-- '小双' '00 ~ 49 中的双数号码' -->
        <div>{{`${$t('mark6_t_030')}：${$t('vn_t_040')}`}}</div>
        <!-- '单单' '00 ~ 99 中，十位数与个位数皆为单数的号码。例如11、35' -->
        <div>{{`${$t('vn_t_028')}：${$t('vn_t_041')}`}}</div>
        <!-- '双双' '00 ~ 99 中，十位数与个位数皆为双数的号码。例如22、46' -->
        <div>{{`${$t('vn_t_029')}：${$t('vn_t_042')}`}}</div>
        <!-- '单双' '00 ~ 99 中，十位数为单数，个位数为双数的号码。例如12、38' -->
        <div>{{`${$t('vn_t_030')}：${$t('vn_t_043')}`}}</div>
        <!-- '双单' '00 ~ 99 中，十位数为双数，个位数为单数的号码。例如21、83' -->
        <div>{{`${$t('vn_t_031')}：${$t('vn_t_044')}`}}</div>
        <!-- '内' '25 ~ 74' -->
        <div>{{`${$t('vn_t_026')}：${$t('vn_t_045')}`}}</div>
        <!-- '外' '00 ~ 24，75 ~ 99' -->
        <div>{{`${$t('vn_t_027')}：${$t('vn_t_046')}`}}</div>
    </div>
</template>
<script>

const listBody = [
    '', // 空值, sp特殊說明
    'vn_t_033', 'vn_t_034', // 50~99 (共50个号码)', '00~49 (共50个号码)
    'vn_t_035', 'vn_t_036', //'01~99中的单数 (共50个号码)', '00~98中的双数 (共50个号码)',
    'vn_t_037', 'vn_t_038', //'50~99中的单数 (共25个号码)', '50~99中的双数 (共25个号码)',
    'vn_t_039', 'vn_t_040', // '00~49中的单数(共25个号码)', '00~49中的双数(共25个号码)',
    'vn_t_041', 'vn_t_042', // '00~99中十位与个位各取一个单数 (共25个号码)', '00~99中十位与个位各取一个单数 (共25个号码)',
    'vn_t_043', 'vn_t_044', // '00~99中十位取一个单数、个位取一个双数 (共25个号码)', '00~99中十位取一个双数、个位取一个单数 (共25个号码)',
    'vn_t_045', 'vn_t_046' // '25~74 (共50个号码)', '00~24,75~99 (共50个号码)'
]

export default {
    name: 'GridTooltip',
    data() {
        return {
            listBody
        }
    },
    props: {
        tipIndex: Number
    }
}
</script>